#### Pandas - Pandas Series & DataFrame

In [2]:
## Importing Pandas
import pandas as pd

In [ ]:
## Pandas Series
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
## Creating a Series from a dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [ ]:
## Giving our desired index/index_name to a series
data=[10,20,30, 50]
series_result = pd.Series(data, index=['math', 'science', 'english', 'econs'])
print(series_result)


## There's another way to achieve just this. See Below:

math       10
science    20
english    30
econs      50
dtype: int64

In [11]:
## The second method
data2=[30,26,70,78]
index=['math2', 'science2', 'english2', 'econs2']
pd.Series(data2, index=index)

math2       30
science2    26
english2    70
econs2      78
dtype: int64

In [ ]:
## Dataframe
## create a Dataframe from a dictionary of list

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [ ]:
## Creating a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [ ]:
### Reading a csv dataset
df = pd.read_csv('data.csv')
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [9]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [ ]:
### Accessing Data From Dataframe
data3=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
]
df=pd.DataFrame(data3)
print(df)

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [ ]:
df['Name']  ## to retrieve a single column from the datframe. This column becomes a series

0    Krish
1     John
2    Bappy
3     JAck
Name: Name, dtype: object

In [19]:
df.loc[0]       ## to look at the record of rows in the dataframe. In this case, row at index '0'

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object

In [20]:
df.iloc[0]       ## to look at the record of columns in the dataframe. In this case, column at index '0'

Name        Krish
Age            32
City    Bangalore
Name: 0, dtype: object